florinbaciuu/esp32s3-console-project/main/app_main.cpp
/**
 * @file      app_main.cpp. 
 * @author    Baciu Aurel Florin
 * @brief     Main application file for the Lilygo T HMI development board.
 * @brief     Demo
 * @license   MIT
 * @copyright Copyright (c) 2025 Baciu Aurel Florin
 * @copyright Oltean East
 * @version   1.0.0
 * 
 * @date      10 July 2025
 * @time      20:40 (PM)
 * @computer  Mac Mini M4
 * ..
 * @details   This file contains the main application logic, including initialization of hardware components,
 */

/*********************
 *      DEFINES
 *********************/
#define BOARD_TFT_DATA0            (48)                // GPIO pin for TFT data line 0
#define BOARD_TFT_DATA1            (47)                // GPIO pin for TFT data line 1
#define BOARD_TFT_DATA2            (39)                // GPIO pin for TFT data line 2
#define BOARD_TFT_DATA3            (40)                // GPIO pin for TFT data line 3
#define BOARD_TFT_DATA4            (41)                // GPIO pin for TFT data line 4
#define BOARD_TFT_DATA5            (42)                // GPIO pin for TFT data line 5
#define BOARD_TFT_DATA6            (45)                // GPIO pin for TFT data line 6
#define BOARD_TFT_DATA7            (46)                // GPIO pin for TFT data line 7
#define BOARD_TFT_RST              (-1)                // GPIO pin for TFT reset, set to -1 if not used
#define BOARD_TFT_CS               (6)                 // GPIO pin for TFT chip select
#define BOARD_TFT_DC               (7)                 // GPIO pin for TFT data/command control
#define BOARD_TFT_WR               (8)                 // GPIO pin for TFT write control
#define LCD_WIDTH                  (320)               // Width of the LCD in pixels
#define LCD_HEIGHT                 (240)               // Height of the LCD in pixels
#define EXAMPLE_LCD_PIXEL_CLOCK_HZ (10 * 1000 * 1000)  // LCD pixel clock frequency in Hz
#define BOARD_TFT_BL               (38)                // GPIO pin for backlight control
#define PWR_EN_PIN                 (10)                // connected to the battery alone
//---------
#define PWR_ON_PIN    (14)  // if you use an ext 5V power supply, you need to bring a magnet close to the ReedSwitch and set the PowerOn Pin (GPIO14) to HIGH
#define Dellp_OFF_PIN (21)  // connected to the battery and the USB power supply, used to turn off the device
//---------
#define PIN_NUM_IRQ  (9)  // IRQ pin for touch controller
#define BAT_ADC_PIN  (5)  // ADC pin for battery voltage measurement
#define PIN_NUM_MISO (4)  // MISO pin for touch controller
#define PIN_NUM_MOSI (3)  // MOSI pin for touch controller
#define PIN_NUM_CLK  (1)  // CLK pin for touch controller
#define PIN_NUM_CS   (2)  // CS pin for touch controller

/*********************
 *    LVGL DEFINES
 *********************/
/* LVGL TASK NOTIFICATION */
#define USE_MUTEX               0
#define USE_FREERTOS_TASK_NOTIF 1     // cica e mai rapid cu 20 %
#define LV_TASK_NOTIFY_SIGNAL   0x01  // Semnalul pentru notificarea LVGL
////#define LV_TASK_NOTIFY_SIGNAL_MODE USE_MUTEX
#define LV_TASK_NOTIFY_SIGNAL_MODE (USE_FREERTOS_TASK_NOTIF)
//---------
/* BUFFER MODE */
#define BUFFER_20LINES     0
#define BUFFER_40LINES     1
#define BUFFER_60LINES     2  // merge
#define BUFFER_DEVIDED4    3
#define BUFFER_FULL        4              // merge super ok
#define BUFFER_MODE        (BUFFER_FULL)  // selecteaza modul de buffer , defaut este BUFFER_FULL
#define DOUBLE_BUFFER_MODE (true)
//---------
/* BUFFER MEMORY TYPE AND DMA */
#define BUFFER_INTERNAL 0
#define BUFFER_SPIRAM   1
#define BUFFER_MEM      (BUFFER_SPIRAM)
#if (BUFFER_MEM == BUFFER_INTERNAL)
#define DMA_ON (true)
#endif
//---------
/* RENDER MODE */
#define RENDER_MODE_PARTIAL 0                      // Modul recomandat pt dual buffer and no canvas and no direct mode
#define RENDER_MODE_FULL    1                      //
#define RENDER_MODE         (RENDER_MODE_PARTIAL)  // selecteaza modul de randare
//---------

/*********************
 *      INCLUDES
 *********************/
extern "C" {
#include <stdio.h>

#include "esp_bootloader_desc.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#define ESP_LCD_IO_I2C_SKIP_INCLUDE 1
#include "esp_lcd_panel_io.h"
#include "esp_lcd_touch_xpt2046.h"
#include "esp_lcd_touch.h"
#include <lv_conf.h>
#include "lvgl.h"
#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_st7789.h"  // Sau driverul real folosit de tine
#include "ui.h"
#include "ResourceMonitor.h"

#include <string.h>
#include <unistd.h>
#include <fcntl.h>
#include "esp_system.h"
#include "esp_console.h"
#include "linenoise/linenoise.h"
#include "argtable3/argtable3.h"
#include "driver/usb_serial_jtag.h"
#include "driver/usb_serial_jtag_vfs.h"
#include "driver/sdmmc_host.h"
#include "esp_vfs_fat.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "soc/soc_caps.h"
#include "sdmmc_cmd.h"

#include "command_line_interface.h"
}

/**********************
 *   GLOBAL FUNCTIONS
 **********************/
// ----------------------------------------------------------

/**
 * Prototypes for functions
 */
void printRamInfoatBoot(void);

// ----------------------------------------------------------

#define SD_CS_PIN      (15)  // Chip Select pentru SPI
#define SD_MISO_PIN    (13)
#define SD_MOSI_PIN    (11)
#define SD_SCLK_PIN    (12)
#define SDIO_DATA0_PIN (13)
#define SDIO_CMD_PIN   (11)
#define SDIO_SCLK_PIN  (12)

#define SD_FREQ_DEFAULT   20000 /*!< SD/MMC Default speed (limited by clock divider) */
#define SD_FREQ_HIGHSPEED 40000 /*!< SD High speed (limited by clock divider) */





/* Console command history can be stored to and loaded from a file.
 * The easiest way to do this is to use FATFS filesystem on top of
 * wear_levelling library.
 */
#if CONFIG_CONSOLE_STORE_HISTORY

// #define MOUNT_PATH   "/data"
#define MOUNT_PATH   "/sdcard"

static void initialize_filesystem_sdmmc(void) {
  esp_vfs_fat_mount_config_t mount_config = {
    .format_if_mount_failed = false, .max_files = 4, .allocation_unit_size = 16 * 1024, .disk_status_check_enable = false, .use_one_fat = false
  };

  sdmmc_card_t *card;
  const char mount_point[] = MOUNT_PATH;

  // Configurare SDMMC host
  sdmmc_host_t host = SDMMC_HOST_DEFAULT();

