florinbaciuu/esp32s3-console-project/main/app_main.cpp
  // Configurare pini slot SDMMC
  sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
  slot_config.clk = (gpio_num_t)SDIO_SCLK_PIN;
  slot_config.cmd = (gpio_num_t)SDIO_CMD_PIN;
  slot_config.d0 = (gpio_num_t)SDIO_DATA0_PIN;
  slot_config.width = 1;  // 1-bit mode

  // (daca ai pull-up externi, poți comenta linia de mai jos)
  gpio_set_pull_mode((gpio_num_t)SDIO_CMD_PIN, GPIO_PULLUP_ONLY);
  gpio_set_pull_mode((gpio_num_t)SDIO_DATA0_PIN, GPIO_PULLUP_ONLY);
  gpio_set_pull_mode((gpio_num_t)SDIO_SCLK_PIN, GPIO_PULLUP_ONLY);

  esp_err_t ret = esp_vfs_fat_sdmmc_mount(mount_point, &host, &slot_config, &mount_config, &card);
  if (ret != ESP_OK) {
    ESP_LOGE("SD", "Failed to mount SDMMC (%s)", esp_err_to_name(ret));
    return;
  }

  ESP_LOGI("SD", "SD card mounted at %s", mount_point);
  sdmmc_card_print_info(stdout, card);
}

#else
#define HISTORY_PATH NULL
#endif  // CONFIG_CONSOLE_STORE_HISTORY

static void initialize_nvs(void) {
  esp_err_t err = nvs_flash_init();
  if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
    ESP_ERROR_CHECK(nvs_flash_erase());
    err = nvs_flash_init();
  }
  ESP_ERROR_CHECK(err);
}






// ----------------------------------------------------------

/**********************
 *   GLOBAL VARIABLES
 **********************/
RTC_DATA_ATTR static uint32_t boot_count = 0;
esp_lcd_panel_io_handle_t touch_io_handle = NULL;
esp_lcd_panel_io_handle_t lcd_io_handle = NULL;
esp_lcd_i80_bus_handle_t i80_bus = NULL;
esp_lcd_touch_handle_t touch_handle = NULL;
esp_lcd_panel_handle_t panel_handle = NULL;
//---------

/**********************
 *   GLOBAL FUNCTIONS
 **********************/
//---------
void gpio_extra_set_init(uint32_t mode) {
  // Setăm ambii pini ca output
  gpio_config_t io_conf = {
    .pin_bit_mask = (1ULL << PWR_EN_PIN) | (1ULL << PWR_ON_PIN),
    .mode = GPIO_MODE_OUTPUT,
    .pull_up_en = GPIO_PULLUP_DISABLE,
    .pull_down_en = GPIO_PULLDOWN_DISABLE,
    .intr_type = GPIO_INTR_DISABLE,
  };
  gpio_config(&io_conf);
  gpio_set_level((gpio_num_t)PWR_EN_PIN, mode);
  gpio_set_level((gpio_num_t)PWR_ON_PIN, mode);  // nu e nevoie de el daca alimentam usb
}
//---------
void power_latch_init() {
  gpio_config_t io_conf = {
    .pin_bit_mask = 1ULL << PWR_EN_PIN,
    .mode = GPIO_MODE_OUTPUT,
    .pull_up_en = GPIO_PULLUP_DISABLE,
    .pull_down_en = GPIO_PULLDOWN_DISABLE,
    .intr_type = GPIO_INTR_DISABLE
  };
  gpio_config(&io_conf);
  gpio_set_level((gpio_num_t)PWR_EN_PIN, 1);  // ⚡ ține placa aprinsă
}
//---------
void gfx_set_backlight(uint32_t mode) {
  gpio_config_t io_conf = {
    .pin_bit_mask = 1ULL << BOARD_TFT_BL,
    .mode = GPIO_MODE_OUTPUT,
    .pull_up_en = GPIO_PULLUP_DISABLE,
    .pull_down_en = GPIO_PULLDOWN_DISABLE,
    .intr_type = GPIO_INTR_DISABLE,
  };
  gpio_config(&io_conf);
  gpio_set_level((gpio_num_t)BOARD_TFT_BL, mode);
}
//---------

/**********************
 *   TOUCH VARIABLES
 **********************/
int16_t touch_map_x1 = 3857;
int16_t touch_map_x2 = 239;
int16_t touch_map_y1 = 213;
int16_t touch_map_y2 = 3693;
uint16_t x = 0, y = 0;
uint8_t num_points = 0;

/**********************
 *   TOUCH FUNCTIONS
 **********************/
int touch_map_value(int val, int in_min, int in_max, int out_min, int out_max) {
  return (val - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}
//---------
void touch_get_calibrated_point(int16_t xraw, int16_t yraw, int16_t *x_out, int16_t *y_out) {
  *x_out = touch_map_value(xraw, touch_map_x1, touch_map_x2, 0, LCD_WIDTH - 1);
  *y_out = touch_map_value(yraw, touch_map_y1, touch_map_y2, 0, LCD_HEIGHT - 1);
  if (*x_out < 0) {
    *x_out = 0;
  }
  if (*x_out >= LCD_WIDTH) {
    *x_out = LCD_WIDTH - 1;
  }
  if (*y_out < 0) {
    *y_out = 0;
  }
  if (*y_out >= LCD_HEIGHT) {
    *y_out = LCD_HEIGHT - 1;
  }
}
//---------
bool touch_read(uint16_t *x_out, uint16_t *y_out) {
  uint16_t x_raw = 0, y_raw = 0;
  uint8_t point_count = 0;
  esp_lcd_touch_read_data(touch_handle);
  bool touched = esp_lcd_touch_get_coordinates(touch_handle, &x_raw, &y_raw, NULL, &point_count, 1);
  if (touched && point_count > 0) {
    int16_t x_cal, y_cal;
    touch_get_calibrated_point(x_raw, y_raw, &x_cal, &y_cal);
    if (x_out) {
      *x_out = x_cal;
    }
    if (y_out) {
      *y_out = y_cal;
    }
    return true;
  }
  return false;
}
//---------
bool touch_panel_is_touched(void) {
  uint16_t x_raw = 0, y_raw = 0;
  uint8_t point_count = 0;
  esp_lcd_touch_read_data(touch_handle);
  bool is_touched = esp_lcd_touch_get_coordinates(touch_handle, &x_raw, &y_raw, NULL, &point_count, 1);
  return is_touched && point_count > 0;
}
//---------

/**********************
 *   LVGL VARIABLES
 **********************/
uint32_t bufSize;              // Dimensiunea buffer-ului
lv_color_t *disp_draw_buf;     // Buffer LVGL
lv_color_t *disp_draw_buf_II;  // Buffer LVGL secundar
lv_display_t *disp;            // Display LVGL

/**********************
 *   LVGL FUNCTIONS
 **********************/
/* Display flushing function callback */
void lv_disp_flush(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
  esp_lcd_panel_draw_bitmap(panel_handle, area->x1, area->y1, area->x2 + 1, area->y2 + 1, (const void *)px_map);
  lv_disp_flush_ready(disp);
}
//---------
void lv_touchpad_read(lv_indev_t *indev_drv, lv_indev_data_t *data) {
  static uint16_t last_x = 0;
  static uint16_t last_y = 0;
  uint16_t x, y;
  if (touch_read(&x, &y)) {
    data->state = LV_INDEV_STATE_PRESSED;
    data->point.x = x;
    data->point.y = y;
    last_x = x;
    last_y = y;
  } else {
    data->state = LV_INDEV_STATE_RELEASED;  // Nu e apăsat → eliberat
    data->point.x = last_x;                 // Păstrăm ultima poziție x (LVGL o cere chiar și în RELEASED)
    data->point.y = last_y;                 // Păstrăm ultima poziție y (LVGL o cere chiar și în RELEASED)
  }
}
//---------
void lv_touchpad_read_v2(lv_indev_t *indev_drv, lv_indev_data_t *data) {
  static uint16_t last_x = 0;                       // Ultima poziție X
  static uint16_t last_y = 0;                       // Ultima poziție Y
  static uint16_t stable_x = 0;                     // Poziția stabilă X
  static uint16_t stable_y = 0;                     // Poziția stabilă Y
  static uint8_t touch_cnt = 0;                     // Numărul de atingeri stabile
  static const uint8_t touch_tolerance = 8;         // Poți crește sau micșora după feeling // Distanța permisă între citiri succesive
  static const uint8_t TOUCH_STABLE_THRESHOLD = 0;  // Threshold pentru stabilitate  // De câte ori trebuie să fie stabil ca să fie considerat apăsat
  uint16_t x, y;
  if (touch_read(&x, &y)) {
    if (abs(x - last_x) < touch_tolerance && abs(y - last_y) < touch_tolerance) {
      if (touch_cnt < 255) {
        touch_cnt++;  // Incrementăm numărul de atingeri stabile
      }
    } else {
      touch_cnt = 0;  // Resetăm dacă mișcarea e prea mare
    }
    last_x = x;
    last_y = y;
    if (touch_cnt >= TOUCH_STABLE_THRESHOLD) {
      data->state = LV_INDEV_STATE_PRESSED;
      stable_x = x;
      stable_y = y;
    } else {
      data->state = LV_INDEV_STATE_RELEASED;  // Nu trimitem touch activ până nu e stabil
    }
  } else {
    data->state = LV_INDEV_STATE_RELEASED;
  }
  data->point.x = stable_x;  // Trimitem ultima poziție stabilă
  data->point.y = stable_y;  // Trimitem ultima poziție stabilă
}
//---------
bool panel_io_trans_done_callback(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx) {
  if (disp != NULL) {
  } else {
    esp_rom_printf("[lv_trans_done_cb] - disp este NULL!\n");
  }
  return false;  // false înseamnă: nu mai face nimic după
}
//---------
uint32_t lv_get_rtos_tick_count_callback(void) {
  return xTaskGetTickCount();
}  // Callback pentru a obține numărul de tick-uri RTOS
//--------------------------------------

