florinbaciuu/esp32s3-console-project/main/app_main.cpp
/*
███████ ██████  ███████ ███████ ██████ ████████  ██████  ███████ 
██      ██   ██ ██      ██      ██   ██   ██    ██    ██ ██      
█████   ██████  █████   █████   ██████    ██    ██    ██ ███████ 
██      ██   ██ ██      ██      ██   ██   ██    ██    ██      ██ 
██      ██   ██ ███████ ███████ ██   ██   ██     ██████  ███████ 
*/

/*********************
 *  rtos variables
 *********************/
TaskHandle_t xHandle_lv_main_task;
TaskHandle_t xHandle_lv_main_tick_task;
TaskHandle_t xHandle_ResourceMonitor;
TaskHandle_t xHandle_v_check_0_pin_state_task;
//---------
#if (LV_TASK_NOTIFY_SIGNAL_MODE == USE_MUTEX)
SemaphoreHandle_t lvgl_mutex;
bool lv_port_sem_take(void) {
  return (xSemaphoreTake(lvgl_mutex, portMAX_DELAY) == pdTRUE);
}
//---------
bool lv_port_sem_give(void) {
  return (xSemaphoreGive(lvgl_mutex) == pdTRUE);
}
#endif  // (LV_TASK_NOTIFY_SIGNAL_MODE == USE_MUTEX)



/********************************************** */
/*                   TASK                       */
/********************************************** */
#if (LV_TASK_NOTIFY_SIGNAL_MODE == USE_MUTEX)
void lv_main_tick_task(void *parameter) {
  static TickType_t tick = 0;
  tick = xTaskGetTickCount();  // Inițializare corectă
  while (true) {
    lv_tick_inc(5);                            // Incrementeaza tick-urile la fiecare 5ms
    vTaskDelayUntil(&tick, pdMS_TO_TICKS(5));  // Delay precis mult mai rapid asa
  }
}
#elif (LV_TASK_NOTIFY_SIGNAL_MODE == USE_FREERTOS_TASK_NOTIF)
void lv_main_tick_task(void *parameter) {
  static TickType_t tick = 0;
  tick = xTaskGetTickCount();
  while (true) {
    lv_tick_inc(5);                                                      // Incrementeaza tick-urile LVGL
    xTaskNotify(xHandle_lv_main_task, LV_TASK_NOTIFY_SIGNAL, eSetBits);  // Notifica task-ul principal
    vTaskDelayUntil(&tick, pdMS_TO_TICKS(5));                            // Delay precis mult mai rapid asa
  }
}
#endif  // (LV_TASK_NOTIFY_SIGNAL_MODE == USE_FREERTOS_TASK_NOTIF)

/********************************************** */
/*                   TASK                       */
/********************************************** */
#if (LV_TASK_NOTIFY_SIGNAL_MODE == USE_MUTEX)
void lv_main_task(void *parameter) {
  static TickType_t tick = 0;
  tick = xTaskGetTickCount();  // Inițializare corectă
  while (true) {
    if (lv_port_sem_take())  // Protejeaza accesul la LVGL
    {
      lv_timer_handler();  /* let the GUI do its work */
      lv_port_sem_give();  // Eliberam mutex-ul
    }
    vTaskDelayUntil(&tick, pdMS_TO_TICKS(5));  // Delay precis mult mai rapid asa
  }
}
#endif  // (LV_TASK_NOTIFY_SIGNAL_MODE == USE_MUTEX)
#if LV_TASK_NOTIFY_SIGNAL_MODE == USE_FREERTOS_TASK_NOTIF
void lv_main_task(void *parameter) {
  static TickType_t tick = 0;
  tick = xTaskGetTickCount();                          // Inițializare corectă
  xHandle_lv_main_task = xTaskGetCurrentTaskHandle();  // Încoronarea oficială
  while (true) {
    uint32_t notificationValue;  // Așteapta notificarea
    BaseType_t notified = xTaskNotifyWait(
      0x00,                // Niciun bit de ignorat
      ULONG_MAX,           // Curata toate biturile
      &notificationValue,  // Primește valoarea notificarii
      portMAX_DELAY
    );  // Așteapta notificarea pe termen nelimitat
    if (notified == pdTRUE && (notificationValue & LV_TASK_NOTIFY_SIGNAL)) {
      lv_timer_handler();  // LVGL își face treaba
    }
    vTaskDelayUntil(&tick, pdMS_TO_TICKS(5));  // Delay precis mult mai rapid asa
  }
}
#endif  // (LV_TASK_NOTIFY_SIGNAL_MODE == USE_FREERTOS_TASK_NOTIF)

/********************************************** */
/*                   TASK                       */
/********************************************** */
static void IRAM_ATTR v_check_0_pin_state_isr_handler(void *arg) {
  // NOTĂ: NU face log sau delay aici
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  xTaskNotifyFromISR((TaskHandle_t)arg, 0x01, eSetBits, &xHigherPriorityTaskWoken);
  if (xHigherPriorityTaskWoken) {
    portYIELD_FROM_ISR();
  }
}
//---------
void v_check_0_pin_state_task(void *parameter) {
  (void)parameter;
  xHandle_v_check_0_pin_state_task = xTaskGetCurrentTaskHandle();  // Încoronarea oficială
  uint32_t notificationValue;
  gpio_config_t io_conf = {
    .pin_bit_mask = 1ULL << 0,
    .mode = GPIO_MODE_INPUT,
    .pull_up_en = GPIO_PULLUP_ENABLE,  // activăm pull-up intern
    .pull_down_en = GPIO_PULLDOWN_DISABLE,
    .intr_type = GPIO_INTR_ANYEDGE,  // întrerupere pe orice schimbare de stare
  };
  gpio_config(&io_conf);
  gpio_install_isr_service(ESP_INTR_FLAG_LEVEL1);  // doar o dată în tot proiectul
  gpio_isr_handler_add((gpio_num_t)0, v_check_0_pin_state_isr_handler, (void *)xHandle_v_check_0_pin_state_task);
  while (true) {
    xTaskNotifyWait(0x00, 0xFFFFFFFF, &notificationValue, portMAX_DELAY);
    if (notificationValue & 0x01) {
      ESP_LOGW("BUTTON", "Button ACTIVAT pe GPIO0");
      //// Acțiune custom (PUNE COD AICI)
    }
    vTaskDelay(200);
  }
}
/****************************/

//--------------------------------------

/*
███    ███  █████  ██ ███    ██ 
████  ████ ██   ██ ██ ████   ██ 
██ ████ ██ ███████ ██ ██ ██  ██ 
██  ██  ██ ██   ██ ██ ██  ██ ██ 
██      ██ ██   ██ ██ ██   ████ 
  * This is the main entry point of the application.
  * It initializes the hardware, sets up the display, and starts the LVGL tasks.
  * The application will run indefinitely until the device is powered off or reset.
*/
extern "C" void app_main(void) {
  //// gpio_extra_set_init(1);
  power_latch_init();  // Inițializare latch pentru alimentare
  gfx_set_backlight(1);
  //// esp_log_level_set("*", ESP_LOG_MAX); //
  esp_log_level_set("*", ESP_LOG_INFO);

  initialize_nvs();

#if CONFIG_CONSOLE_STORE_HISTORY
  //initialize_filesystem();
  initialize_filesystem_sdmmc();
  ESP_LOGI("CONSOLE", "Command history enabled");
#else
  ESP_LOGI("CONSOLE", "Command history disabled");
#endif
  /* Initialize console output periheral (UART, USB_OTG, USB_JTAG) */
  initialize_console_peripheral();

