florinbaciuu/esp32s3-console-project/main/app_main.cpp
  /* Initialize linenoise library and esp_console*/
  initialize_console_library(HISTORY_PATH);

  /* Prompt to be printed before each line.
     * This can be customized, made dynamic, etc.
     */
  const char *prompt = setup_prompt(PROMPT_STR ">");

  /* Register commands */
  esp_console_register_help_command();
  //register_system_common();

  cli_register_all_commands(); // my command

  boot_count++;
  ESP_LOGI("RTC", "Boot count (from RTC RAM): %lu", boot_count);
  esp_sleep_enable_timer_wakeup(5000000);  // 5 secunde în microsecunde

  esp_bootloader_desc_t bootloader_desc;
  printf("\n");
  ESP_LOGI("Bootloader description", "\tESP-IDF version from 2nd stage bootloader: %s\n", bootloader_desc.idf_ver);
  ESP_LOGI("Bootloader description", "\tESP-IDF version from app: %s\n", IDF_VER);
  // printf("\tESP-IDF version from 2nd stage bootloader: %s\n", bootloader_desc.idf_ver);
  // printf("\tESP-IDF version from app: %s\n", IDF_VER);

  esp_lcd_i80_bus_config_t lcd_bus_config = {
    .dc_gpio_num = BOARD_TFT_DC,
    .wr_gpio_num = BOARD_TFT_WR,
    .clk_src = LCD_CLK_SRC_DEFAULT,
    .data_gpio_nums =
      {
        BOARD_TFT_DATA0,
        BOARD_TFT_DATA1,
        BOARD_TFT_DATA2,
        BOARD_TFT_DATA3,
        BOARD_TFT_DATA4,
        BOARD_TFT_DATA5,
        BOARD_TFT_DATA6,
        BOARD_TFT_DATA7,
      },
    .bus_width = 8,
    .max_transfer_bytes = LCD_WIDTH * LCD_HEIGHT * sizeof(uint16_t),
    .psram_trans_align = 64,
    .sram_trans_align = 4
  };
  // esp_lcd_new_i80_bus(&lcd_bus_config, &i80_bus);
  ESP_ERROR_CHECK(esp_lcd_new_i80_bus(&lcd_bus_config, &i80_bus));

  esp_lcd_panel_io_i80_config_t lcd_io_config = {
    .cs_gpio_num = BOARD_TFT_CS,
    .pclk_hz = EXAMPLE_LCD_PIXEL_CLOCK_HZ,
    .trans_queue_depth = 10,
    .on_color_trans_done = panel_io_trans_done_callback,
    .user_ctx = NULL,
    .lcd_cmd_bits = 8,
    .lcd_param_bits = 8,
    .dc_levels =
      {
        .dc_idle_level = 0,
        .dc_cmd_level = 0,
        .dc_dummy_level = 0,
        .dc_data_level = 1,
      },
    .flags = {
      .cs_active_high = 0,
      .reverse_color_bits = 0,
      .swap_color_bytes = 1,
      .pclk_active_neg = 0,
      .pclk_idle_low = 0,
    },
  };
  ESP_ERROR_CHECK(esp_lcd_new_panel_io_i80(i80_bus, &lcd_io_config, &lcd_io_handle));

  esp_lcd_panel_dev_config_t panel_config = {
    .reset_gpio_num = BOARD_TFT_RST,
    .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
    .data_endian = LCD_RGB_DATA_ENDIAN_BIG,
    .bits_per_pixel = 16,
    .flags =
      {
        .reset_active_high = 1,
      },
    .vendor_config = NULL,
  };
  ESP_ERROR_CHECK(esp_lcd_new_panel_st7789(lcd_io_handle, &panel_config, &panel_handle));
  ESP_LOGI("LVGL", "ST7789 panel created");
  ESP_ERROR_CHECK(esp_lcd_panel_reset(panel_handle));
  ESP_LOGI("LVGL", "ST7789 panel reset done");
  ESP_ERROR_CHECK(esp_lcd_panel_set_gap(panel_handle, 0, 0));
  ESP_LOGI("LVGL", "ST7789 panel gap set");
  ESP_ERROR_CHECK(esp_lcd_panel_init(panel_handle));
  ESP_LOGI("LVGL", "ST7789 panel initialized");
  ESP_ERROR_CHECK(esp_lcd_panel_invert_color(panel_handle, false));
  ESP_LOGI("LVGL", "ST7789 panel color inversion set");
  ESP_ERROR_CHECK(esp_lcd_panel_mirror(panel_handle, false, true));
  ESP_LOGI("LVGL", "ST7789 panel mirror set");
  ESP_ERROR_CHECK(esp_lcd_panel_swap_xy(panel_handle, true));
  ESP_LOGI("LVGL", "ST7789 panel swap xy set %bool", true);
  ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel_handle, true));
  ESP_LOGI("LVGL", "ST7789 panel display on");

  //  Configurare SPI Touch IO
  spi_bus_config_t buscfg = {
    .mosi_io_num = (int)PIN_NUM_MOSI,
    .miso_io_num = (int)PIN_NUM_MISO,
    .sclk_io_num = (int)PIN_NUM_CLK,
    .quadwp_io_num = (int)(-1),
    .quadhd_io_num = (int)(-1),
    .data4_io_num = (int)(-1),
    .data5_io_num = (int)(-1),
    .data6_io_num = (int)(-1),
    .data7_io_num = (int)(-1),
    .data_io_default_level = 0,
    .max_transfer_sz = (int)4096,
    .flags = 0,
    .isr_cpu_id = (esp_intr_cpu_affinity_t)0,
    .intr_flags = 0
  };
  ESP_ERROR_CHECK(spi_bus_initialize(SPI2_HOST, &buscfg, SPI_DMA_CH_AUTO));
  ESP_LOGI("LVGL", "SPI bus initialized");

  // Configurare IO pentru touch
  esp_lcd_panel_io_spi_config_t touch_io_config = {
    .cs_gpio_num = (gpio_num_t)PIN_NUM_CS,
    .dc_gpio_num = GPIO_NUM_NC,
    .spi_mode = 0,
    .pclk_hz = ESP_LCD_TOUCH_SPI_CLOCK_HZ,
    .trans_queue_depth = 3,
    .on_color_trans_done = NULL,
    .user_ctx = NULL,
    .lcd_cmd_bits = 8,
    .lcd_param_bits = 8,
    .cs_ena_pretrans = 0,
    .cs_ena_posttrans = 0,
    .flags = {
      .dc_high_on_cmd = 0, .dc_low_on_data = 0, .dc_low_on_param = 0, .octal_mode = 0, .quad_mode = 0, .sio_mode = 0, .lsb_first = 0, .cs_high_active = 0
    }
  };
  ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi(SPI2_HOST, &touch_io_config, &touch_io_handle));
  ESP_LOGI("LVGL", "Touch panel IO created");

  // Configurare driver touch
  esp_lcd_touch_config_t touch_config = {
    .x_max = 4095,
    .y_max = 4095,
    .rst_gpio_num = (gpio_num_t)-1,
    .int_gpio_num = (gpio_num_t)PIN_NUM_IRQ,
    .levels = {.reset = 0, .interrupt = 0},
    .flags = {.swap_xy = true, .mirror_x = false, .mirror_y = false},
    .process_coordinates = NULL,
    .interrupt_callback = NULL,
    .user_data = NULL,
    .driver_data = NULL
  };
  ESP_ERROR_CHECK(esp_lcd_touch_new_spi_xpt2046(touch_io_handle, &touch_config, &touch_handle));
  ESP_LOGI("LVGL", "Touch panel created");

  lv_init();
  lv_tick_set_cb(lv_get_rtos_tick_count_callback);
  disp = lv_display_create((int32_t)LCD_WIDTH, (int32_t)LCD_HEIGHT);

#if (BUFFER_MODE == BUFFER_FULL)
  bufSize = ((LCD_WIDTH * LCD_HEIGHT) * lv_color_format_get_size(lv_display_get_color_format(disp)));
#elif (BUFFER_MODE == BUFFER_60LINES)
  bufSize = ((LCD_WIDTH * 60) * lv_color_format_get_size(lv_display_get_color_format(disp)));
#elif (BUFFER_MODE == BUFFER_40LINES)
  bufSize = ((LCD_WIDTH * 40) * lv_color_format_get_size(lv_display_get_color_format(disp)));
#elif (BUFFER_MODE == BUFFER_20LINES)
  bufSize = ((LCD_WIDTH * 20) * lv_color_format_get_size(lv_display_get_color_format(disp)));
#elif (BUFFER_MODE == BUFFER_DEVIDED4)
  bufSize = ((LCD_WIDTH * LCD_HEIGHT) * lv_color_format_get_size(lv_display_get_color_format(disp)) / 4);
#endif
#if (BUFFER_MEM == BUFFER_SPIRAM)
#if (DOUBLE_BUFFER_MODE == 1)
  disp_draw_buf = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_SPIRAM);
  disp_draw_buf_II = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_SPIRAM);
  ESP_LOGI("LVGL", "LVGL buffers created in SPIRAM");
#else
  disp_draw_buf = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_SPIRAM);
#endif
#elif (BUFFER_MEM == BUFFER_INTERNAL)
#if (DMA_ON == 1)
#if (DOUBLE_BUFFER_MODE == 1)
  disp_draw_buf = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
  disp_draw_buf_II = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
  ESP_LOGI("LVGL", "LVGL buffers created in SPIRAM");
#else
  disp_draw_buf = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
#endif
#else
#if (DOUBLE_BUFFER_MODE == 1)
  disp_draw_buf = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_INTERNAL);
  disp_draw_buf_II = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_INTERNAL);
  ESP_LOGI("LVGL", "LVGL buffers created in SPIRAM");
#else
  disp_draw_buf = (lv_color_t *)heap_caps_malloc(bufSize, MALLOC_CAP_INTERNAL);
#endif
#endif
#endif

  if (!disp_draw_buf) {  // VERIFICA DACA PRIMUL BUFFER ESTE CREAT
    ESP_LOGE("LVGL", "LVGL disp_draw_buf allocate failed!");
  }
#if (DOUBLE_BUFFER_MODE == 1)
  if (!disp_draw_buf_II) {  // VERIFICA DACA AL DOILEA BUFFER ESTE CREAT
    ESP_LOGE("LVGL", "LVGL disp_draw_buf_II allocate failed!");
  }
#endif

#if (DOUBLE_BUFFER_MODE == 1)
  lv_display_set_buffers(disp, disp_draw_buf, disp_draw_buf_II, bufSize, (lv_display_render_mode_t)RENDER_MODE);
  ESP_LOGI("LVGL", "LVGL buffers set");
#else
  lv_display_set_buffers(disp, disp_draw_buf, NULL, bufSize, (lv_display_render_mode_t)RENDER_MODE);
#endif

