florinbaciuu/esp32s3-console-project/main/app_main.cpp
  lv_display_set_resolution(disp, LCD_WIDTH, LCD_HEIGHT);                   // Seteaza rezolutia software
  lv_display_set_physical_resolution(disp, LCD_WIDTH, LCD_HEIGHT);          // Actualizeaza rezolutia reala
  lv_display_set_rotation(disp, (lv_display_rotation_t)0);                  // Seteaza rotatia lvgl
  lv_display_set_render_mode(disp, (lv_display_render_mode_t)RENDER_MODE);  // Seteaza (lv_display_render_mode_t)
  lv_display_set_antialiasing(disp, true);                                  // Antialiasing DA sau NU
  ESP_LOGI("LVGL", "LVGL display settings done");

  lv_display_set_flush_cb(disp, lv_disp_flush);  // Set the flush callback which will be called to copy the rendered image to the display.
  ESP_LOGI("LVGL", "LVGL display flush callback set");

  lv_indev_t *indev = lv_indev_create();           /*Initialize the (dummy) input device driver*/
  lv_indev_set_type(indev, LV_INDEV_TYPE_POINTER); /*Touchpad should have POINTER type*/
  ////lv_indev_set_read_cb(indev, lv_touchpad_read);    // old version
  lv_indev_set_read_cb(indev, lv_touchpad_read_v2);
  ESP_LOGI("LVGL", "LVGL Setup done");

#if LV_TASK_NOTIFY_SIGNAL_MODE == USE_MUTEX
  ESP_LOGI("LVGL", "Se creaza LVGL mutex!");
  lvgl_mutex = xSemaphoreCreateMutex();
  if (lvgl_mutex == NULL) {
    ESP_LOGE("LVGL", "Eroare: Mutex-ul LVGL nu a fost creat!");
    while (1);  // Blocheaza executia daca mutex-ul nu poate fi creat
  }
#endif  // (LV_TASK_NOTIFY_SIGNAL_MODE == USE_MUTEX)

  create_tabs_ui();  // Creeaza interfata grafica

  printRamInfoatBoot();

  printf(
    "\n"
    "This is an example of ESP-IDF console component.\n"
    "Type 'help' to get the list of commands.\n"
    "Use UP/DOWN arrows to navigate through command history.\n"
    "Press TAB when typing command name to auto-complete.\n"
    "Ctrl+C will terminate the console environment.\n"
  );

  if (linenoiseIsDumbMode()) {
    printf(
      "\n"
      "Your terminal application does not support escape sequences.\n"
      "Line editing and history features are disabled.\n"
      "On Windows, try using Putty instead.\n"
    );
  }

  // start_resource_monitor();
  StartCLI(true);

  xTaskCreatePinnedToCore(
    lv_main_task,                           // Functia task-ului
    (const char *)"LVGL Main Task",         // Numele task-ului
    (uint32_t)(4096 + 4096),                // Dimensiunea stack-ului
    (NULL),                                 // Parametri (daca exista)
    (UBaseType_t)configMAX_PRIORITIES - 3,  // Prioritatea task-ului
    &xHandle_lv_main_task,                  // Handle-ul task-ului
    ((1))                                   // Nucleul pe care ruleaza task-ul
  );

  xTaskCreatePinnedToCore(
    lv_main_tick_task,                      // Functia care ruleaza task-ul
    (const char *)"LVGL Tick Task",         // Numele task-ului
    (uint32_t)(2048 + 1024),                // Dimensiunea stack-ului
    (NULL),                                 // Parametri
    (UBaseType_t)configMAX_PRIORITIES - 1,  // Prioritatea task-ului
    &xHandle_lv_main_tick_task,             // Handle-ul task-ului
    ((1))                                   // Nucleul pe care ruleaza (ESP32 e dual-core)
  );

  xTaskCreatePinnedToCore(
    v_check_0_pin_state_task,               // Functia care ruleaza task-ul
    (const char *)"v_check_0_pin_state",    // Numele task-ului
    (uint32_t)(4096),                       // Dimensiunea stack-ului
    (NULL),                                 // Parametri
    (UBaseType_t)configMAX_PRIORITIES - 6,  // Prioritatea task-ului
    &xHandle_v_check_0_pin_state_task,      // Handle-ul task-ului
    ((1))                                   // Nucleul pe care ruleaza (ESP32 e dual-core)
  );

  
}  // app_main

/********************************************** */
/*               FUNCTIONS                      */
/********************************************** */


/********************************************** */
/* Print RAM info at boot time */
// Aceasta functie afiseaza informatii despre RAM la boot
// Este utila pentru a verifica daca PSRAM-ul este activat si configurat corect
// Se apeleaza in app_main() dupa initializarea hardware-ului si a LVGL
// Se foloseste heap_caps_get_total_size() si heap_caps_get_free_size() pentru a
// obtine informatii despre diferitele tipuri de memorie RAM disponibile
// Se afiseaza informatiile in formatul: "Total RAM memory: X bytes
// "Free RAM memory: Y bytes"
// Unde X este dimensiunea totala a memoriei RAM si Y este dimensiunea memoriei RAM libere
// Se afiseaza informatii despre RAM intern, RAM-DMA, RAM 8 bit, RAM 32 bit, RTC RAM, PSRAM,
// PSRAM 8 bit si PSRAM 32 bit
// Se folosesc macro-urile MALLOC_CAP_INTERNAL, MALLOC_CAP_DMA, MALLOC_CAP_8BIT,
// MALLOC_CAP_32BIT, MALLOC_CAP_RTCRAM si MALLOC_CAP_SPIRAM pentru a specifica tipul de memorie
// Se folosesc functiile heap_caps_get_total_size() si heap_caps_get_free_size()
// pentru a obtine dimensiunile memoriei RAM
// Se afiseaza si dimensiunea stivei principale a task-ului principal
// pentru a verifica daca este suficienta pentru a rula aplicatia
// Se foloseste uxTaskGetStackHighWaterMark() pentru a obtine dimensiunea stivei
// Se afiseaza informatiile in formatul: "Main task stack left: Z bytes"
// Unde Z este dimensiunea stivei principale a task-ului principal
// Aceasta functie este utila pentru a verifica daca aplicatia are suficiente resurse
// pentru a rula corect si pentru a depista eventuale probleme de memorie
// Este recomandat sa se apeleze aceasta functie la inceputul aplicatiei
// pentru a avea o imagine de ansamblu asupra resurselor disponibile
// si pentru a putea face ajustari daca este necesar
// De exemplu, daca PSRAM-ul nu este activat, se poate activa in Kconfig
// sau in codul sursa al aplicatiei
// Daca PSRAM-ul este activat, se poate verifica daca este configurat corect
// si daca este suficient pentru a rula aplicatia
// Daca dimensiunea stivei principale a task-ului principal este prea mica,
// se poate mari in Kconfig sau in codul sursa al aplicatiei
void printRamInfoatBoot(void) {
  ESP_LOGI("SYSTEM", "Total RAM          memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_INTERNAL));
  ESP_LOGI("SYSTEM", "Free RAM           memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL));

  ESP_LOGI("SYSTEM", "Total RAM-DMA      memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_DMA));
  ESP_LOGI("SYSTEM", "Free RAM-DMA       memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_DMA));

  ESP_LOGI("SYSTEM", "Total RAM 8 bit    memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
  ESP_LOGI("SYSTEM", "Free RAM 8 bit     memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));

  ESP_LOGI("SYSTEM", "Total RAM 32 bit   memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_32BIT));
  ESP_LOGI("SYSTEM", "Free RAM 32 bit    memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_32BIT));

  ESP_LOGI("SYSTEM", "Total RTC RAM      memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_RTCRAM));
  ESP_LOGI("SYSTEM", "Free RTC RAM       memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_RTCRAM));

  ESP_LOGI("SYSTEM", "Total PSRAM        memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_SPIRAM));
  ESP_LOGI("SYSTEM", "Free PSRAM         memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM));

  ESP_LOGI("SYSTEM", "Total PSRAM 8 bit  memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));
  ESP_LOGI("SYSTEM", "Free PSRAM 8 bit   memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT));

  ESP_LOGI("SYSTEM", "Total PSRAM 32 bit memory: %u bytes", heap_caps_get_total_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_32BIT));
  ESP_LOGI("SYSTEM", "Free PSRAM 32 bit  memory: %u bytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_32BIT));

  ESP_LOGI("STACK", "Main task stack left: %d bytes", uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t));
}  // printRamInfoatBoot

/********************************************** */

/**********************
 *   END OF FILE
 **********************/
